#提取出符合转化词组的关键词
#组合参数越精细，结果越完善，漏得越少
#组合取完之后再按规则分梯队


sed -i 's/\r//g' $1
cp $1 tmp

#土巴兔
sed -n -r '/[土士吧巴八兔免图]{3,}/p' tmp >土巴兔

#装修词
sed -n -r '/装修|装饰|装潢|家装|简装|基装|硬装|软装|精装|设计|家装|改造|建筑|装璜|旧房翻新|装房子|家居/p' tmp >装修

#风格
sed -n -r '/简欧|北欧|简约|中式|欧式|美式|简美|田园|欧美|日式|现代|韩式|乡村|地中海|法式|复古|英伦|混搭|北欧简约|港式|泰式|古典|新中式|宜家|极简|自然|东南亚|后现代|西欧|北美|朴素|简欧式|明清|小美|日韩|日系|雅致|新古典|简中式|中欧式|简约式|英式|奢华|中欧|书香|田园式|怀旧|乡土|藏式|浪漫|森林|小美式|简洁|轻快|纯美式|时尚|柔和|极简约|精致|欧美式|地中海式|纯欧式|德式|黑白灰|海洋|轻美式|西式|新美式|仿古|巴洛克|新欧式|白欧|纯中式|洛可可|新简欧|非洲|现代简约|现代田园|现代中式|现代时尚|现代简欧|现代北欧|现代奢华|现代韩式|豪华现代|后现代奢华|现代美式|现代欧式|现代前卫|现代复古|现代混搭|现代新中式|现代古典|现代东南亚|现代港式|现代温馨|现代时尚简约|现代地中海|现代极简|现代日式|现代黑白|时尚现代|简约现代中式|后现代简约|中式现代简约|中式简约|欧式简约|简约美式|简约北欧|韩式简约|简约田园|简约欧美|简约温馨|简约时尚|自然简约|日式简约|简约复古|简约奢华|简约英伦|简约混搭|简约法式|地中海简约|简约新中式|欧式田园|韩式田园|简欧田园|美式田园|中式田园|英式田园|田园乡村|地中海田园|欧美田园|别墅田园|时尚田园|英伦田园|复式简欧|简欧美式|豪华简欧|简欧混搭|简欧古典|时尚简欧|欧式复古|欧式古典|欧式奢华|简单欧式|豪华欧式|欧式乡村|欧式混搭|新古典欧式|美式乡村|美式复古|美式古典|美式混搭|美式北欧|中式古典|中式复古|中式乡村|中式混搭|简单中式|新东南亚|时尚混搭|欧式宫廷|欧式地中海|民族|英式乡村|农家|古朴|台式|欧洲|休闲|中西|温馨|乡村地中海|波西米亚|苏格兰|汉唐|童话|现代式|欧陆|可爱|新地中海|澳洲|中西混搭|复式欧式|新古典主义|现代简约风格|现代田园风格|复古风格|东南亚风格|英伦风格|现代风格|地中海风格|简欧风格|田园风格|现代中式风格|简约风格|原木风格|托斯卡纳|黑白风格|托斯卡纳风格|小清新风格|小清新|古典主义|古典主义风格|韩国|徽派|园林式|极简主义|极简主义风格|西班牙风格|中国风|复古风|波希米亚风|纯美地中海|波希米亚风格|低调奢华|法国地中海风格|欧式风格|哥特式|波普|哥特风格|波普风|现代主义风格|赖特风格|后现代主义风格|后现代主义设计|哥特式风格|后现代主义|现代主义|波普风格|北欧风情|拜占庭风格|波西米亚风|巴洛克式|简单|拜占庭式|波普艺术风格|意式风格/p' tmp >风格

#空间
sed -n -r '/中庭|主卧室|主卧|书房|二楼|亭子|休息室|会议室|佛堂|候机楼|储物间|储藏室|儿童书房|儿童卧室|儿童影楼|儿童房|儿童电脑桌|入户花园|入户门正对墙|入户阳台|全屋|公主屋|公主房|冷藏室|凉亭|凉台|别墅花园|化妆间|北阳台|卧室|卧房|卫生间|厕所|厨卫|厨房|吊顶|围墙|地下室|地下庭院|墙壁|外墙|大厅|大堂|大露台|天井|天花|女儿房间|女孩房|女生房间|婚房|婴儿房|客厅|客房|室内|家庭影院|家庭汗蒸房|宿舍|小居室|小庭院|小房间|小浴室|小阳台|小院|小餐厅|屋顶花园|庭园|庭院|开间|形象墙|影视墙|情趣房|教室|整体浴室|暗厅|棚顶|楼梯|楼道|楼顶花园|次卧|歺厅|洋房|洗手间|洗衣房|浴室|淋浴房|游泳池|玄关|玻璃屋|电梯间|电梯|电视墙|电视背景墙|男孩房间|空中花园|空调室|空间|背景墙|花园|花圃|花坛|花房|茶室|菜园|衣帽间|视听室|走廊墙面|走廊|起居室|车库|过道|酒窖|门厅|门头|阁楼|阳光房|阳台|隔断墙|隔断间|隔断|露台阳光房|露台|顶楼|餐厅|饭厅|logo墙/p' tmp >空间

#公装
sed -n -r '/中国馆|中央厨房|主题ktv|书画展厅|休闲吧|会场|会所|会馆|体育场馆|体育场|体育馆|体验馆|俱乐部|值班室|停车场|健身房|儿童乐园|儿童游乐园|儿童照相馆|免费图书馆|党员活动室|公共卫生间|公共厕所|公厕|公司|公园|养猪场|养生会所|养生馆|养老院|养鸡场|写字楼|农家乐|农家院|农庄|农贸市场|剧院|办公大楼|办公室|办公楼|化验室|医院病房|医院|午托班|卖场|博物馆|厂房|发廊|口腔诊所|古堡|台球厅|台球室|咖啡厅|咖啡吧|咖啡屋|咖啡馆|售楼处|售楼部|商业街|商住楼|商务会所|商场|商用厨房|商铺门面|商铺|园林|国奥村|图书室|图书馆|场馆|城堡|多功能会议厅|多功能厅|多媒体会议室|多媒体教室|夜场|夜总会|大会议室|大学|央视大楼|女子养生会所|女生宿舍|如家|婚庆公司|婚庆现场|婚纱专卖|婚纱影楼|孔庙|学校|学生公寓|实验室|宠物房|客栈|室内游泳馆|室内高尔夫球场|室内高尔夫练习场|宴会厅|家居生活馆|家电卖场|家电商场|宾馆|宿舍|寝室|小区|展位|展厅|展台|展架|展示厅|展览馆|展馆|工作室|干蒸房|幼儿园|广场|庄园|度假村|录音室|录音棚|彩钢厂房|影剧院|影楼|影院|快捷宾馆|手术室|招待所|接待室|摄影棚|政府办公楼|故宫博物院|教堂|教室|文化广场|文化馆|旅行社|旅馆|服务台|服装设计工作室|校园|校门|格子铺|桑拿房|桑拿洗浴中心|棋牌室|楼盘|橱窗|歌厅|歌舞厅|步行街|水吧|水疗会所|汗蒸房|汗蒸馆|汗蒸|汽车展厅|汽车旅馆|泳池|洗浴中心|洽谈区|洽谈室|浴场|海洋馆|清吧|游乐园|游乐场|游泳池|游泳馆|溜冰场|滑雪场|牙科诊所|玻璃门|理疗会所|琴行|瑜伽会馆|瑜伽馆|生态园设计|生活家居馆|电教室|电脑卖场|画室|画廊|眼镜超市|礼堂|祠堂|私人会所|立体停车场|篮球场|紫禁城|纪念馆|网吧|网咖|美发|美容中心|美容会所|美容院|美术馆|舞台|花坛|茶庄|茶楼|茶社|茶艺馆|茶铺|茶馆|菜园|蛋糕房|规划展示馆|诊所|购物中心|购物广场|超市收银台|超市|足球场|足疗会所|车行|车间|轻钢结构厂房|迪厅|酒吧|酒庄|酒文化博物馆|酒楼|银行|铺面|门面|阶梯教室|餐厅|陈列馆|面馆|音乐厅|飞机场|食堂|餐馆|饭馆|高尔夫球场|高档发廊|高档私人会所|高端会所|ktv/p' tmp >公装

#价格
sed -n -r '/多少钱|价格|报价|造价|最贵|费用|均价|设计费|预算|[0-9一二三四五六七八九十]+万/p' tmp >价格

#房型
sed -n -r '/一室一厅一卫一厨|一室一厅一卫|一室一厅小户型|一室一厅|一室户|一室|一层别墅|一层半小别墅|一层平房|一层房子|一层房屋|一层楼房|一层|一居室小户型|一居室|一居|一房一厅|一房|一梯三户|三室一厅一卫|三室一厅一厨一卫|三室一厅|三室两厅一卫|三室两厅两卫|三室两厅|三室二厅二卫|三室二厅|三室|三室2厅|三层别墅|三层房屋|三层楼房|三居室户型|三居室|三居|三房一厅一厨一卫|三房一厅|三房两厅两卫|三房两厅|三房二厅二卫|三房二厅|三房|三房2厅|三间房子|东南向的|两厅|两室一厅一厨一卫|两室一厅|两室两厅|两室二厅|两室|两层别墅|两层半|两层小别墅|两层楼房|两居室|两居|两房一厅|两房两厅|两房改三房|两房|中户型|二室一厅|二室二厅|二室|二层别墅|二层半别墅|二层房屋|二层楼房|二层|二居室|二居|二房二厅|二房|公寓式住宅|公寓房|公寓|农庄木屋|别墅|单元房|单层别墅|单身公寓|单间|双拼别墅|双拼房|叠拼别墅|叠拼|吊脚楼|四合院|四室一厅一厨一卫|四室一厅|四室两厅两卫|四室两厅|四室二厅|四室|四房一厅|四房两厅两卫|四房两厅|四房|复室|复式住宅|复式房|复式楼房|复式楼|复式|多层住宅|大户型|套房|婚房|客厅和餐厅连在一起|小三室一厅|小三室两厅|小三室|小三居|小三房|小两室一厅|小两室|小两居|小两房一厅|小两房|小公寓|小别墅|小型公寓|小型别墅|小复式楼|小复式|小居室|小户型公寓|小户型跃层|小户型|小户型loft|小户|小房型|小房子|小房屋|小房|小洋房|小洋楼|小跃层|屋子|平房|户型|房中房|房子|房屋|木别墅|木屋|极小户型|楼中楼|楼房|民居|洋房|流水别墅|海景房|独栋别墅|独栋|窑洞|联排别墅|花园别墅|花园洋房|萨伏伊别墅|赖特流水别墅|超小户型|跃层住宅|跃层小户型|跃层式住宅|跃层式|跃层|跃式|酒店式公寓|钢结构别墅|错层|阳光别墅|顶层公寓|顶楼复式|高档公寓|高档别墅|高级别墅|1室1厅|1居室|2室|2室1厅|2室2厅|2室2厅1卫|2居室|2房|3室两厅|3室|3室1厅|3室1厅2卫|3室2厅|3室2厅1卫|3室2厅2卫|3层别墅|3居室|3房|3房2厅2卫|4室2厅|4室2厅2卫|4房|loft公寓|loft户型|loft/p' tmp >房型


#价格 图片词
sed -n -r '/图/p' 价格 >>转化词


#价格 局部
sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' 价格 >>转化词

#价格 建材
sed -n -r '/LED灯|台灯|吊灯|日光灯|射灯|吸顶灯|筒灯|壁灯|镜前灯|小夜灯|落地灯|应急灯|户外灯|橱柜|马桶|龙头|浴缸|淋浴房|地漏|水槽|角阀|花洒|挂钩|置物架|拖把池|蹲便器|洗手盆|墙纸|瓷砖|地板|涂料|腻子粉|金箔|隔音棉|管材|浴霸|石材|暖气片|钢材|板材|床头灯|天花灯|仿古砖|外墙砖|扶梯|移动门|推拉门|平开门|壁纸|墙壁纸|大折叠门|石膏线|蜡烛灯|墙漆|木门|霓虹灯|淋浴喷头|琉璃砖|窗台板|坐式马桶|鹅卵石|台面|货架|木地板|环保乳胶漆|门|浴室门|液体壁纸|书橱|pvc墙纸|百叶门|地砖|大铁门|包厢门|手动旋转门|面包砖|毛巾架|阳台门|厨房门|厨卫门|隔断门|卫生间门|公园门|墙地砖|卧室门|衣帽间门|大衣柜门|防盗门|整体浴室|卫浴洁具|砖|仿木地板瓷砖|电视背景壁纸|墙面漆|防滑垫|水晶灯具|墙砖|踢脚线|地脚线|电梯门|台上盆|壁布|铝百叶帘|塑胶地板|踏步板|吊顶灯|铝扣板|面盆|led蜡烛灯|移门|小吊灯|护墙板|灯饰|复合地板|马赛克|水晶吊灯|免漆木门|地灯|衣橱|整体卫浴间|折叠门|玉石砖|玻璃砖|大理石砖|圆形浴缸|洗脸台|造型门|艺术灯|吊轨推拉门|玻璃幕墙|水晶卷帘门|楼梯龙骨|套装门|液态壁纸|淋浴柱|搁板|卷帘门|电扇灯|房门|家用桑拿房|木纹地砖|壁挂炉|地脚灯|连体座便器|强化复合地板|墙布|木浴桶|冲浪浴缸|吊扇灯|布艺台灯|卷帘窗|地板砖|地毯砖|整体淋浴房|马赛克|石膏板|地板革|栅栏|木板|过门石|水晶灯|透水砖|抛光砖|灯带|防爆门|旋转门|青砖|门槛石|石库门|仿石砖|红砖|青石板|庭院灯|学生床|矿棉板|景观石|波打线|腰线|烤漆玻璃|风扇灯|吸塑板|彩灯|釉面砖|子母门|通体砖|草坪灯|外墙漆|墙板|座便器|花灯|复合门|拉篮|入户门|杉木板|台盆|荧光漆|吊趟门|雅士白|塑钢门|景观灯|假山石|隔板|花砖|亚光砖|光纤灯|雕花板|防滑砖|墙角线|走廊灯|栅栏门|趟门|拼花地砖|墙排马桶|围墙灯|led格栅灯|内墙砖|实木生态板|水墨画壁纸|水银灯|门把手|洗面盆|两翼旋转门|花卉壁纸|青石砖|格子壁纸|铸铁浴缸|侧排马桶|挂墙式马桶|智能马桶|铜门|生态砖|整体浴房|推拉折叠门|防滑地垫|毛巾杆|子母防盗门|弧形门|电视壁纸|太阳能景观灯|防滑地板砖|餐吊灯|隔断板|入墙式马桶|led壁灯|洗脸盆柜|双人浴缸|led室内灯|门锁|门板|密码锁防盗门|连体马桶|折叠浴缸|安全门|感应门|烤漆门|铁门|自动门|伸缩门|液体墙纸|无纺布墙纸|阳光板|吊顶龙骨|led吸顶灯|惠达卫浴|科勒卫浴|led筒灯|led灯带|无框玻璃门|led射灯|led日光灯|浪鲸卫浴|萨米特瓷砖|自动感应门|舞蹈地板|led天花灯|液体壁纸漆|led灯条|卡米亚瓷砖|冠军瓷砖|德立淋浴房|美陶瓷砖|无纺布壁纸|乙级防火门|外墙乳胶漆|泰山石膏板|多层实木地板|木纤维壁纸|轨道射灯|小蜜蜂瓷砖|宏陶瓷砖|拼花地板|儿童地垫|宏耐地板|防水石膏板|充气浴缸|亚克力浴缸|自动旋转门|艺术壁纸|贝壳马赛克|塑料扣板|强化复合木地板|卡通墙纸|三层实木地板|条纹壁纸|生态板|led装饰灯|落地玻璃窗|镂空雕花板|无框玻璃窗|无水箱马桶|艺术马赛克|弧形自动门|玉石马赛克|车库翻板门|壁纸漆|搁物架|卫浴毛巾架|内墙瓷砖|半隐框玻璃幕墙|浴室垫|拼花砖|落地灯箱|马可波罗瓷砖|弧形浴帘杆|立地书橱|水晶台灯|通贵竹地板|特陶马桶|纸巾架|家用汗蒸房|碎花墙纸|木浴盆|液体墙纸漆|大厅灯|扇形浴缸|面盆柜|意大利橱柜|木桶浴缸|方太整体厨房|砂岩板|木质浴桶|花纹壁纸|樱桃木饰面板|木质浴盆|雕花门|东灿集成吊顶|无轨推拉门|钢门窗|地弹簧门|水晶球吊灯|仿木砖|门拉手/p' 价格 >>转化词


#价格 面积
sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' 价格 >>转化词

#价格 公装
sed -n -r '/多少钱|价格|报价|造价|最贵|费用|均价|设计费|预算|[0-9一二三四五六七八九十]+万/p' 公装 >>转化词

#公装 图片词
sed -n -r '/图/p' 公装 >>转化词


#公装 家具
sed -n -r '/床|衣柜|床垫|梳妆台|床头柜|梳妆凳|穿衣镜|衣帽架|鞋架|斗柜|酒柜|餐桌|酒架|餐边柜|吧台椅|扶手椅|靠背椅|茶桌|咖啡桌|儿童椅|餐椅|晾衣架|花架|折叠桌|吊篮|摇椅|吊床|折叠椅|秋千|公园椅|藤椅|休闲椅|电脑桌|书架|书柜|书桌|学习桌|收纳箱|电脑椅|收纳盒|收纳袋|收纳柜|工作台|转椅|收纳架|CD架|沙发|鞋柜|电视柜|博古架|屏风|椅子|茶几|展示柜|麻将桌|贵妃椅|装饰柜|电视架|组合柜|地柜|视听柜|储物柜|珠宝展柜|红酒柜|整体衣柜|办公桌椅|图书架|大衣柜|柜门|隔厅柜|柜子|间厅柜|三门衣柜|展柜|眼镜展柜|六斗柜|衣柜带鞋柜|入墙式衣柜|三斗柜|高档红酒柜|衣橱柜|衣柜门|衣帽柜|浴柜|手机柜台|葡萄酒柜|豪华红酒柜|旋转衣柜|推拉门大衣柜|双门衣柜|水泥橱柜|四门衣柜|台盆柜|卫浴柜|布衣柜|门厅柜|五斗柜|整体橱柜|整体浴室柜|浴室柜|橱柜门|洗衣柜|儿童书柜|化妆品展柜|家用酒柜|小书柜|墙柜|玄关柜|一体橱柜|衣柜移门|珠宝柜台|折叠式衣柜|铁柜子|集成橱柜|茶水柜|飘窗柜|厨房柜|货柜|转角柜|移门衣柜|橱柜柜门|组合衣柜|组合书柜|化妆品展示柜|吸塑橱柜|电子酒柜|茶柜|普田|电脑柜|办公书柜|板式衣柜|边柜|展台展柜|抽屉柜|步入式衣柜|整体浴柜|会议桌|办公桌|收银台|子母床|布艺床|折叠凳子|书台|板式办公桌|懒人沙发|接待台|单人床|化妆台|隐形书架|双面书架|木床|可折叠餐桌|衣橱门|演讲台|壁柜门|台式电脑桌|儿童床|课桌椅|躺椅|婴儿摇床|办公屏风|办公椅|皮艺床|折叠椅子|幼儿床|沙发折叠床|三人沙发床|隐形床|双人充气床|皮床|会议台|母子床|办公台|上下床|皮沙发|家庭用餐桌|折叠沙发床|前台办公桌|艺术屏风|沙发凳|双胞胎婴儿床|饰品货架|老板桌办公桌|儿童桌|电脑办公桌|双层床|家庭用花架|洽谈桌|架子床|办公转椅|角几|儿童上下床|组合办公桌|食堂餐桌椅|大班椅|金属椅|上下实木床|茶台|秋千吊椅|秋千椅|写字台|曲木椅|花架子|升降椅|折叠床|婴儿床|高低床|罗汉床|藤摇椅|沙发垫|玻化砖|文件柜|双人床|吊椅|水床垫|凳子|佛龛|座椅|隔断柜|棕垫|八仙桌|餐桌椅|软床|老板椅|神龛|榉木床|铁皮柜|礼堂椅|折叠桌子|更衣柜|沙滩椅|陈列柜|资料架|木沙发|板式床|吊篮椅|铁架床|充气床|摇摇椅|三人床|置物柜|换鞋凳|陈列架|红床|玻璃柜|洗头床|中药柜|写字桌|折叠沙发|沙发椅|输液椅|电脑台|吧椅|小沙发|小桌子|小书架|婚床|裤架|藤沙发|大班台|圆餐桌|快餐桌|木柜|童床|屏风柜|升降桌|餐台|西餐桌|炕桌|班椅|镜台|妆台|皮椅|儿童餐桌椅|嵌入式衣柜|配件柜|婴儿摇椅|功夫茶桌|儿童滑梯床|实木桌|小书桌|报刊架|美发镜台|开放式衣柜|桌|货架|家用沙发|单人铁床|健身椅|化妆品柜台|课桌|伸缩餐桌|学生书架|收纳凳|酒杯架|儿童写字台|布衣沙发|书报架|根雕花架|婴儿餐桌椅|家用鞋架|红酒酒架|学习桌椅|办公大班台|儿童实木床|洽谈桌椅|洗头椅|中班椅|红酒杯架|圆形床|布艺软床|折叠会议桌|排椅|儿童木床|快餐椅|铁床|桌椅|儿童家具|折叠餐桌|长椅|布艺沙发|儿童高低床|折叠躺椅|走入式衣柜|联邦家具|紫檀家具|赖氏家具|根雕茶桌|楷模家具|儿童学习桌|红星美凯龙家具|儿童衣柜|双层儿童床|藤艺家具|转角沙发|电动护理床|亚振家具|学生课桌椅|电脑椅子|足疗沙发|儿童餐椅|单人折叠床|折叠式餐桌|雅宝家具|托玛琳床垫|手机展柜|圣奥家具|达芬奇家具|藤编家具|宝宝餐椅|榻榻米床垫|充气沙发|休闲桌椅|笔记本电脑桌|中至信家具|儿童沙发|转角书柜|休闲椅子|儿童书架|办公文件柜|双人铁床|转角电脑桌|可伸缩餐桌|办公会议桌|洗手柜|洽谈椅|展示柜台|吊柜|滑梯床|连排椅|酒吧椅|双人沙发床|高档餐桌|根雕茶几|宝宝餐桌椅|高档沙发|桌子|六门更衣柜|麦当劳餐桌椅|好莱客衣柜|小圆凳|电脑沙发椅|藤编沙发|展览柜|海鸥沙发|电脑凳|落地衣帽架|组合电视柜|芝华士功能沙发|楷模沙发|顾家工艺沙发|包豪斯沙发|三强衣帽架|长餐桌|婴儿木床|敞开式衣柜|屏风式办公桌|钢架床|洗衣机组合柜|蓝鸟沙发|台式机电脑桌|多喜爱儿童床|写字台书柜组合|太师椅|首饰展示架|木餐椅|组合式衣柜|羽丰沙发|四层书架|康宝沙发|曲美布艺沙发|电视地柜|美发椅子|入墙衣柜|休闲凳|折叠沙发椅|上下铺木床|办公铁柜|储物架/p' 公装 >>转化词

#公装 家饰
sed -n -r '/窗花|装饰画|灯笼|花瓶|壁画|十字绣|墙画|墙壁画|手绘壁画|浮雕画|桌花|墙绘|墙面画|水晶珠帘|主题墙饰|壁饰|墙贴画|抽象装饰画|水晶窗帘|圣诞树|吊旗|桌旗|摆件|手工艺品|水族箱|墙面彩绘|家居摆件|吊饰|墙体彩绘|水晶装饰品|鱼缸|相框|数字油画|桌布|挂画|挂钟|无框画|手绘画|手绘墙画|墙面涂鸦|黄金摆件|镜框|挂件|羊毛坐垫|木雕工艺品|水晶灯饰|墙上装饰品|根雕|黑白画|画框|玉雕|浮雕|浮雕壁画|电表箱装饰画|马赛克画|墙面绘画|墙体绘画|木雕摆件|串珠纸巾盒图片|彩绘|墙饰|贴画|蜡烛台|水晶饰品|手绘墙面|春联|壁挂式鱼缸|泰国手工艺品|diy手工艺品|陈设品|艺术品|剪画|隐形壁画|工艺品|熏香灯|墙面装饰贴画|墙贴|挂壁式鱼缸|儿童手绘墙/p' 公装 >>转化词

#公装 局部
sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' 公装 >>转化词


#公装 面积
sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' 公装 >>转化词


#图片词 颜色
sed -n -r '/图/p' tmp | sed '/黑色|咖啡色|橙色|香槟色|蓝色|绿色|红色|白色|紫色|粉色|浅蓝色|暖色|灰色|冷色|特色|粉红色|咖色|原木色|中性色|浅色|装饰色|浅绿色|柚木色|浅咖啡色|暗色|浅紫色|红白色|彩色|淡蓝色|深色|金色|茶色|银色|黑白色|深蓝色|米黄色|天蓝色|黑白|米黄|金线米黄|粉红|卡奇色/p' >>转化词


#城市 价格 建材
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' 价格 | sed -n -r '/LED灯|台灯|吊灯|日光灯|射灯|吸顶灯|筒灯|壁灯|镜前灯|小夜灯|落地灯|应急灯|户外灯|橱柜|马桶|龙头|浴缸|淋浴房|地漏|水槽|角阀|花洒|挂钩|置物架|拖把池|蹲便器|洗手盆|墙纸|瓷砖|地板|涂料|腻子粉|金箔|隔音棉|管材|浴霸|石材|暖气片|钢材|板材|床头灯|天花灯|仿古砖|外墙砖|扶梯|移动门|推拉门|平开门|壁纸|墙壁纸|大折叠门|石膏线|蜡烛灯|墙漆|木门|霓虹灯|淋浴喷头|琉璃砖|窗台板|坐式马桶|鹅卵石|台面|货架|木地板|环保乳胶漆|门|浴室门|液体壁纸|书橱|pvc墙纸|百叶门|地砖|大铁门|包厢门|手动旋转门|面包砖|毛巾架|阳台门|厨房门|厨卫门|隔断门|卫生间门|公园门|墙地砖|卧室门|衣帽间门|大衣柜门|防盗门|整体浴室|卫浴洁具|砖|仿木地板瓷砖|电视背景壁纸|墙面漆|防滑垫|水晶灯具|墙砖|踢脚线|地脚线|电梯门|台上盆|壁布|铝百叶帘|塑胶地板|踏步板|吊顶灯|铝扣板|面盆|led蜡烛灯|移门|小吊灯|护墙板|灯饰|复合地板|马赛克|水晶吊灯|免漆木门|地灯|衣橱|整体卫浴间|折叠门|玉石砖|玻璃砖|大理石砖|圆形浴缸|洗脸台|造型门|艺术灯|吊轨推拉门|玻璃幕墙|水晶卷帘门|楼梯龙骨|套装门|液态壁纸|淋浴柱|搁板|卷帘门|电扇灯|房门|家用桑拿房|木纹地砖|壁挂炉|地脚灯|连体座便器|强化复合地板|墙布|木浴桶|冲浪浴缸|吊扇灯|布艺台灯|卷帘窗|地板砖|地毯砖|整体淋浴房|马赛克|石膏板|地板革|栅栏|木板|过门石|水晶灯|透水砖|抛光砖|灯带|防爆门|旋转门|青砖|门槛石|石库门|仿石砖|红砖|青石板|庭院灯|学生床|矿棉板|景观石|波打线|腰线|烤漆玻璃|风扇灯|吸塑板|彩灯|釉面砖|子母门|通体砖|草坪灯|外墙漆|墙板|座便器|花灯|复合门|拉篮|入户门|杉木板|台盆|荧光漆|吊趟门|雅士白|塑钢门|景观灯|假山石|隔板|花砖|亚光砖|光纤灯|雕花板|防滑砖|墙角线|走廊灯|栅栏门|趟门|拼花地砖|墙排马桶|围墙灯|led格栅灯|内墙砖|实木生态板|水墨画壁纸|水银灯|门把手|洗面盆|两翼旋转门|花卉壁纸|青石砖|格子壁纸|铸铁浴缸|侧排马桶|挂墙式马桶|智能马桶|铜门|生态砖|整体浴房|推拉折叠门|防滑地垫|毛巾杆|子母防盗门|弧形门|电视壁纸|太阳能景观灯|防滑地板砖|餐吊灯|隔断板|入墙式马桶|led壁灯|洗脸盆柜|双人浴缸|led室内灯|门锁|门板|密码锁防盗门|连体马桶|折叠浴缸|安全门|感应门|烤漆门|铁门|自动门|伸缩门|液体墙纸|无纺布墙纸|阳光板|吊顶龙骨|led吸顶灯|惠达卫浴|科勒卫浴|led筒灯|led灯带|无框玻璃门|led射灯|led日光灯|浪鲸卫浴|萨米特瓷砖|自动感应门|舞蹈地板|led天花灯|液体壁纸漆|led灯条|卡米亚瓷砖|冠军瓷砖|德立淋浴房|美陶瓷砖|无纺布壁纸|乙级防火门|外墙乳胶漆|泰山石膏板|多层实木地板|木纤维壁纸|轨道射灯|小蜜蜂瓷砖|宏陶瓷砖|拼花地板|儿童地垫|宏耐地板|防水石膏板|充气浴缸|亚克力浴缸|自动旋转门|艺术壁纸|贝壳马赛克|塑料扣板|强化复合木地板|卡通墙纸|三层实木地板|条纹壁纸|生态板|led装饰灯|落地玻璃窗|镂空雕花板|无框玻璃窗|无水箱马桶|艺术马赛克|弧形自动门|玉石马赛克|车库翻板门|壁纸漆|搁物架|卫浴毛巾架|内墙瓷砖|半隐框玻璃幕墙|浴室垫|拼花砖|落地灯箱|马可波罗瓷砖|弧形浴帘杆|立地书橱|水晶台灯|通贵竹地板|特陶马桶|纸巾架|家用汗蒸房|碎花墙纸|木浴盆|液体墙纸漆|大厅灯|扇形浴缸|面盆柜|意大利橱柜|木桶浴缸|方太整体厨房|砂岩板|木质浴桶|花纹壁纸|樱桃木饰面板|木质浴盆|雕花门|东灿集成吊顶|无轨推拉门|钢门窗|地弹簧门|水晶球吊灯|仿木砖|门拉手/p' >>转化词

#城市 价格 面积
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' 价格 | sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' >>转化词

#城市 公装
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' 公装 >>转化词


#城市 家具
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' tmp | sed -n -r '/床|衣柜|床垫|梳妆台|床头柜|梳妆凳|穿衣镜|衣帽架|鞋架|斗柜|酒柜|餐桌|酒架|餐边柜|吧台椅|扶手椅|靠背椅|茶桌|咖啡桌|儿童椅|餐椅|晾衣架|花架|折叠桌|吊篮|摇椅|吊床|折叠椅|秋千|公园椅|藤椅|休闲椅|电脑桌|书架|书柜|书桌|学习桌|收纳箱|电脑椅|收纳盒|收纳袋|收纳柜|工作台|转椅|收纳架|CD架|沙发|鞋柜|电视柜|博古架|屏风|椅子|茶几|展示柜|麻将桌|贵妃椅|装饰柜|电视架|组合柜|地柜|视听柜|储物柜|珠宝展柜|红酒柜|整体衣柜|办公桌椅|图书架|大衣柜|柜门|隔厅柜|柜子|间厅柜|三门衣柜|展柜|眼镜展柜|六斗柜|衣柜带鞋柜|入墙式衣柜|三斗柜|高档红酒柜|衣橱柜|衣柜门|衣帽柜|浴柜|手机柜台|葡萄酒柜|豪华红酒柜|旋转衣柜|推拉门大衣柜|双门衣柜|水泥橱柜|四门衣柜|台盆柜|卫浴柜|布衣柜|门厅柜|五斗柜|整体橱柜|整体浴室柜|浴室柜|橱柜门|洗衣柜|儿童书柜|化妆品展柜|家用酒柜|小书柜|墙柜|玄关柜|一体橱柜|衣柜移门|珠宝柜台|折叠式衣柜|铁柜子|集成橱柜|茶水柜|飘窗柜|厨房柜|货柜|转角柜|移门衣柜|橱柜柜门|组合衣柜|组合书柜|化妆品展示柜|吸塑橱柜|电子酒柜|茶柜|普田|电脑柜|办公书柜|板式衣柜|边柜|展台展柜|抽屉柜|步入式衣柜|整体浴柜|会议桌|办公桌|收银台|子母床|布艺床|折叠凳子|书台|板式办公桌|懒人沙发|接待台|单人床|化妆台|隐形书架|双面书架|木床|可折叠餐桌|衣橱门|演讲台|壁柜门|台式电脑桌|儿童床|课桌椅|躺椅|婴儿摇床|办公屏风|办公椅|皮艺床|折叠椅子|幼儿床|沙发折叠床|三人沙发床|隐形床|双人充气床|皮床|会议台|母子床|办公台|上下床|皮沙发|家庭用餐桌|折叠沙发床|前台办公桌|艺术屏风|沙发凳|双胞胎婴儿床|饰品货架|老板桌办公桌|儿童桌|电脑办公桌|双层床|家庭用花架|洽谈桌|架子床|办公转椅|角几|儿童上下床|组合办公桌|食堂餐桌椅|大班椅|金属椅|上下实木床|茶台|秋千吊椅|秋千椅|写字台|曲木椅|花架子|升降椅|折叠床|婴儿床|高低床|罗汉床|藤摇椅|沙发垫|玻化砖|文件柜|双人床|吊椅|水床垫|凳子|佛龛|座椅|隔断柜|棕垫|八仙桌|餐桌椅|软床|老板椅|神龛|榉木床|铁皮柜|礼堂椅|折叠桌子|更衣柜|沙滩椅|陈列柜|资料架|木沙发|板式床|吊篮椅|铁架床|充气床|摇摇椅|三人床|置物柜|换鞋凳|陈列架|红床|玻璃柜|洗头床|中药柜|写字桌|折叠沙发|沙发椅|输液椅|电脑台|吧椅|小沙发|小桌子|小书架|婚床|裤架|藤沙发|大班台|圆餐桌|快餐桌|木柜|童床|屏风柜|升降桌|餐台|西餐桌|炕桌|班椅|镜台|妆台|皮椅|儿童餐桌椅|嵌入式衣柜|配件柜|婴儿摇椅|功夫茶桌|儿童滑梯床|实木桌|小书桌|报刊架|美发镜台|开放式衣柜|桌|货架|家用沙发|单人铁床|健身椅|化妆品柜台|课桌|伸缩餐桌|学生书架|收纳凳|酒杯架|儿童写字台|布衣沙发|书报架|根雕花架|婴儿餐桌椅|家用鞋架|红酒酒架|学习桌椅|办公大班台|儿童实木床|洽谈桌椅|洗头椅|中班椅|红酒杯架|圆形床|布艺软床|折叠会议桌|排椅|儿童木床|快餐椅|铁床|桌椅|儿童家具|折叠餐桌|长椅|布艺沙发|儿童高低床|折叠躺椅|走入式衣柜|联邦家具|紫檀家具|赖氏家具|根雕茶桌|楷模家具|儿童学习桌|红星美凯龙家具|儿童衣柜|双层儿童床|藤艺家具|转角沙发|电动护理床|亚振家具|学生课桌椅|电脑椅子|足疗沙发|儿童餐椅|单人折叠床|折叠式餐桌|雅宝家具|托玛琳床垫|手机展柜|圣奥家具|达芬奇家具|藤编家具|宝宝餐椅|榻榻米床垫|充气沙发|休闲桌椅|笔记本电脑桌|中至信家具|儿童沙发|转角书柜|休闲椅子|儿童书架|办公文件柜|双人铁床|转角电脑桌|可伸缩餐桌|办公会议桌|洗手柜|洽谈椅|展示柜台|吊柜|滑梯床|连排椅|酒吧椅|双人沙发床|高档餐桌|根雕茶几|宝宝餐桌椅|高档沙发|桌子|六门更衣柜|麦当劳餐桌椅|好莱客衣柜|小圆凳|电脑沙发椅|藤编沙发|展览柜|海鸥沙发|电脑凳|落地衣帽架|组合电视柜|芝华士功能沙发|楷模沙发|顾家工艺沙发|包豪斯沙发|三强衣帽架|长餐桌|婴儿木床|敞开式衣柜|屏风式办公桌|钢架床|洗衣机组合柜|蓝鸟沙发|台式机电脑桌|多喜爱儿童床|写字台书柜组合|太师椅|首饰展示架|木餐椅|组合式衣柜|羽丰沙发|四层书架|康宝沙发|曲美布艺沙发|电视地柜|美发椅子|入墙衣柜|休闲凳|折叠沙发椅|上下铺木床|办公铁柜|储物架/p' >>转化词

#城市 局部
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' tmp | sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' >>转化词

#城市 建材
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' tmp | sed -n -r '/LED灯|台灯|吊灯|日光灯|射灯|吸顶灯|筒灯|壁灯|镜前灯|小夜灯|落地灯|应急灯|户外灯|橱柜|马桶|龙头|浴缸|淋浴房|地漏|水槽|角阀|花洒|挂钩|置物架|拖把池|蹲便器|洗手盆|墙纸|瓷砖|地板|涂料|腻子粉|金箔|隔音棉|管材|浴霸|石材|暖气片|钢材|板材|床头灯|天花灯|仿古砖|外墙砖|扶梯|移动门|推拉门|平开门|壁纸|墙壁纸|大折叠门|石膏线|蜡烛灯|墙漆|木门|霓虹灯|淋浴喷头|琉璃砖|窗台板|坐式马桶|鹅卵石|台面|货架|木地板|环保乳胶漆|门|浴室门|液体壁纸|书橱|pvc墙纸|百叶门|地砖|大铁门|包厢门|手动旋转门|面包砖|毛巾架|阳台门|厨房门|厨卫门|隔断门|卫生间门|公园门|墙地砖|卧室门|衣帽间门|大衣柜门|防盗门|整体浴室|卫浴洁具|砖|仿木地板瓷砖|电视背景壁纸|墙面漆|防滑垫|水晶灯具|墙砖|踢脚线|地脚线|电梯门|台上盆|壁布|铝百叶帘|塑胶地板|踏步板|吊顶灯|铝扣板|面盆|led蜡烛灯|移门|小吊灯|护墙板|灯饰|复合地板|马赛克|水晶吊灯|免漆木门|地灯|衣橱|整体卫浴间|折叠门|玉石砖|玻璃砖|大理石砖|圆形浴缸|洗脸台|造型门|艺术灯|吊轨推拉门|玻璃幕墙|水晶卷帘门|楼梯龙骨|套装门|液态壁纸|淋浴柱|搁板|卷帘门|电扇灯|房门|家用桑拿房|木纹地砖|壁挂炉|地脚灯|连体座便器|强化复合地板|墙布|木浴桶|冲浪浴缸|吊扇灯|布艺台灯|卷帘窗|地板砖|地毯砖|整体淋浴房|马赛克|石膏板|地板革|栅栏|木板|过门石|水晶灯|透水砖|抛光砖|灯带|防爆门|旋转门|青砖|门槛石|石库门|仿石砖|红砖|青石板|庭院灯|学生床|矿棉板|景观石|波打线|腰线|烤漆玻璃|风扇灯|吸塑板|彩灯|釉面砖|子母门|通体砖|草坪灯|外墙漆|墙板|座便器|花灯|复合门|拉篮|入户门|杉木板|台盆|荧光漆|吊趟门|雅士白|塑钢门|景观灯|假山石|隔板|花砖|亚光砖|光纤灯|雕花板|防滑砖|墙角线|走廊灯|栅栏门|趟门|拼花地砖|墙排马桶|围墙灯|led格栅灯|内墙砖|实木生态板|水墨画壁纸|水银灯|门把手|洗面盆|两翼旋转门|花卉壁纸|青石砖|格子壁纸|铸铁浴缸|侧排马桶|挂墙式马桶|智能马桶|铜门|生态砖|整体浴房|推拉折叠门|防滑地垫|毛巾杆|子母防盗门|弧形门|电视壁纸|太阳能景观灯|防滑地板砖|餐吊灯|隔断板|入墙式马桶|led壁灯|洗脸盆柜|双人浴缸|led室内灯|门锁|门板|密码锁防盗门|连体马桶|折叠浴缸|安全门|感应门|烤漆门|铁门|自动门|伸缩门|液体墙纸|无纺布墙纸|阳光板|吊顶龙骨|led吸顶灯|惠达卫浴|科勒卫浴|led筒灯|led灯带|无框玻璃门|led射灯|led日光灯|浪鲸卫浴|萨米特瓷砖|自动感应门|舞蹈地板|led天花灯|液体壁纸漆|led灯条|卡米亚瓷砖|冠军瓷砖|德立淋浴房|美陶瓷砖|无纺布壁纸|乙级防火门|外墙乳胶漆|泰山石膏板|多层实木地板|木纤维壁纸|轨道射灯|小蜜蜂瓷砖|宏陶瓷砖|拼花地板|儿童地垫|宏耐地板|防水石膏板|充气浴缸|亚克力浴缸|自动旋转门|艺术壁纸|贝壳马赛克|塑料扣板|强化复合木地板|卡通墙纸|三层实木地板|条纹壁纸|生态板|led装饰灯|落地玻璃窗|镂空雕花板|无框玻璃窗|无水箱马桶|艺术马赛克|弧形自动门|玉石马赛克|车库翻板门|壁纸漆|搁物架|卫浴毛巾架|内墙瓷砖|半隐框玻璃幕墙|浴室垫|拼花砖|落地灯箱|马可波罗瓷砖|弧形浴帘杆|立地书橱|水晶台灯|通贵竹地板|特陶马桶|纸巾架|家用汗蒸房|碎花墙纸|木浴盆|液体墙纸漆|大厅灯|扇形浴缸|面盆柜|意大利橱柜|木桶浴缸|方太整体厨房|砂岩板|木质浴桶|花纹壁纸|樱桃木饰面板|木质浴盆|雕花门|东灿集成吊顶|无轨推拉门|钢门窗|地弹簧门|水晶球吊灯|仿木砖|门拉手/p' >>转化词

#城市 房型
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' 房型 >>转化词


#城市 房类
sed -n -r '/北京|上海|广州|深圳|南京|东莞|天津|杭州|郑州|苏州|重庆|西安|武汉|成都|昆明|济南|无锡|合肥|佛山|青岛|沈阳|大连|宁波|温州|长沙|石家庄|福州|惠州|三亚|义乌|潍坊|济宁|烟台|南通|常州|徐州|南阳|洛阳|焦作|台州|嘉兴|金华|唐山|廊坊|鞍山|厦门|泉州|南昌|赣州|大庆|哈尔滨|南宁|柳州|长春|太原|贵阳|呼和浩特|乌鲁木齐|兰州|黎川|南丰|中山|珠海|汕头|清远|江门|肇庆|连云港|昆山|宿迁|扬州|镇江|淮安|衢州|湖州|舟山|绍兴|芜湖|九江|泸州|自贡|德阳|绵阳|榆林|银川|包头|遵义|盐城|宜昌|宿州|黄山|海口|咸阳|凯里|株洲|开封|北海|信阳|江阴|桂林|十堰|襄阳|湘潭|岳阳|衡阳|滁州|常熟|新乡|漳州|阳江|毕节|秦皇岛|乌兰察布|宁德|淄博|铁岭|淮南|临沂|安庆|六盘水|河源|三明|泰州|汉中|保定|邯郸|沧州|永州|云浮|湛江|曲靖|张家口|阜阳|六安|蚌埠|常德|荆门|西宁|眉山|资阳|黄石|宝鸡|铜仁|广安|菏泽|枣庄|丽水|鹰潭|韶关|吉林|百色|茂名|揭阳|威海|东营|普洱|保山|孝感|大同|营口|锦州|抚顺|衡水|本溪|莆田|益阳|郴州|怀化|娄底|邵阳|张家界|咸宁|三门峡|通化|黄冈|周口|商丘|邢台|南充|防城港|平顶山|龙岩|赤峰|宜宾|宜春|绥化|贵港|临汾|晋中|遂宁|汕尾|滨州|日照|濮阳|梧州|葫芦岛|玉林|丹东|辽阳|朝阳|马鞍山|梅州|承德|佳木斯|广元|聊城|许昌|亳州|运城|驻马店|泰安|荆州|抚州|玉溪|德州|吉安|乐山|长治|安顺|内江|上饶|天水|陇南|河池|昭通|琼海|来宾|齐齐哈尔|渭南|景德镇|安阳|达州|普宁|四平|安康|鄂州|崇左|漯河|南平|大理|鹤壁|鹤岗|牡丹江|双鸭山|鸡西|楚雄|呼伦贝尔|锡林郭勒盟|西双版纳/p' tmp | sed -n -r '/旧房|老房|二手房|毛坯房/p' >>转化词

#面积  图片词
sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' tmp | sed -n -r '/图/p' >>转化词

#材质  局部
sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' tmp | sed -n -r '/玻璃|实木|木质|软木|软包|大理石|红木|原木|硅藻泥|金丝楠木|钢材|板材|石材|管材|木制|不锈钢|全不锈钢|橡木|真皮|天然大理石|铁艺|石膏|柚木|砂岩|钢板|塑料|铝合金|艺术玻璃|桑拿板|木饰面|防腐木|鸡翅木|红橡木|生态木|全实木|水曲柳面板|木头|仿实木|复合实木|磨砂玻璃|白橡木|人造石|微晶石|文化砖|文化石|硬包|老榆木|石英石|胡桃木|绿可木|花梨木|乳胶|榆木|船木|红酸枝红木|黄花梨木|水磨石|钢木|松木|金丝南木|曲木|水曲柳饰面板|樱桃木|青砖|陶瓷|水晶|布艺|古船木|榉木|柏木|樟木|楠木|藤木|烤漆|铁皮|金属|红酸枝|水晶玻璃|檀木|杉木|人造大理石|亚克力|竹木|红桃木/p' >>转化词

#局部 图片词
sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' tmp | sed -n -r '/图/p' >>转化词

#局部 面积
sed -n -r '/飘窗|楼梯|墙|浴池|窗台|吧台|门头|墙角|窗户|花格|墙裙|门框|外墙|顶棚|隔断|炕床|天花|壁柜|窗子|壁橱|窗|凸窗|地炕|墙面|隔层|进门|窗套|门脸|地面|房梁|地床|墙体|门窗|柜台|榻榻米床|榻榻米|吊顶|背景墙|厨柜|落地窗|灶台|电视背景墙|屏风隔断|旋转楼梯|集成吊顶|壁炉|隐形门|照片墙|壁龛|电视墙|天花板|床背景墙|小背景墙|电视墙背景|大门|护栏|手绘墙|沙发背景墙|沙发墙|装饰墙|手绘电视墙|玻璃墙|手绘背景墙|整体壁柜|景观墙|拐角|门口|影视墙|暗门|围墙大门|文化墙|墙壁|顶面|门洞|相片墙|防盗窗|3d背景墙|屋顶|扶手|宣传栏|灯池|楼顶|彩绘墙|围墙|门楼|棚顶|天窗|护角|床头|月亮门|门套|主题墙|喷泉|车库门|围栏|公司背景墙|剪刀楼梯|梁式楼梯|窗帘盒|大飘窗|罗马柱|造型墙|操作台|液晶电视背景墙|雨棚|鱼池|拱形门|柱子|隔断墙|公司形象墙|阴角线|阳角线|格珊吊顶|地台|开关手绘墙|相框墙|卡座|木吊顶|升旗台|区角|吊棚|防盗门窗|百页窗|百叶窗|墙衣|前台|形象墙|电视背景|门楣|垭口|推拉窗|涂鸦墙|植物墙|隔音墙|楼梯踏步|拱门|塌塌米|多宝阁|展示台|木楼梯|水幕墙|多宝格|服务台|艺术墙|移动隔断墙|铁栏杆|隔墙|螺旋楼梯|床靠背|全玻璃幕墙|钢架楼梯|铁艺栅栏|假山鱼池|木扶手|展示架|斜屋顶窗|活动隔墙|门牌|校门|立体背景墙|铜楼梯|液晶电视墙|电视机背景墙|栏杆|伸缩楼梯|隐形防盗窗|企业文化墙|钢结构阁楼|格栅吊顶|防盗纱窗|品格集成吊顶|钢结构雨棚|容声集成吊顶|液晶拼接墙|镂空隔断|楼梯立柱|雕花隔断|楼梯栏杆|隐框玻璃幕墙|明框玻璃幕墙|淋浴隔断|企业形象墙|圆形吊顶|钢结构车棚|美步楼梯|小区护栏|水晶楼梯|自动扶梯|隔间|藻井式吊顶|镂空雕花隔断|小电视墙|房顶|烟囱|立体电视墙|小电视背景墙|像片墙|挂衣墙/p' tmp | sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' >>转化词

#房型 价格
sed -n -r '/多少钱|价格|报价|造价|最贵|费用|均价|设计费|预算|[0-9一二三四五六七八九十]+万/p' 房型 >>转化词

#房型 图片
sed -n -r '/图/p' 房型 >>转化词

#房型 面积
sed -n -r '/[0-9一二三四五六七八九十]+平[方米]*/p' 房型 >>转化词


#结果合并
cat 装修 空间 土巴兔 风格 >>转化词

#最终结果去重
sort -u 转化词 >转化词.txt

#删除临时文件
rm tmp 装修 公装 局部 价格 空间 土巴兔 风格 转化词 房型 2> /dev/null

#排序
sort $1 -o $1
sort 转化词.txt -o 转化词.txt
 
#提取第五梯队
comm -3 $1 转化词.txt >五梯队.txt